;;; private/jseba/packages.el  -*- no-byte-compile: t; -*-

;;; Programming
(package! lsp-mode)
(package! company-lsp)
(package! ivy-xref)

;;; C/C++ packages
(package! cmake-mode)
(package! demangle-mode)
(package! disaster)
(package! modern-cpp-font-lock)
(package! cquery)
(package! irony)
(package! company-irony)
(package! company-irony-c-headers)
